---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTable.#ctor
source: html/7517ee6b-bead-0f55-a5bd-0954c60a5e5f.htm
---
# Autodesk.Revit.DB.ExportLayerTable.#ctor Method

Constructs a new ExportLayerTable with default values.

## Syntax (C#)
```csharp
public ExportLayerTable()
```